{"keras_version": "2.1.5", "class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"config": {"batch_input_shape": [null, 200], "sparse": false, "dtype": "float32", "name": "input_11"}, "inbound_nodes": [], "name": "input_11", "class_name": "InputLayer"}, {"config": {"input_dim": 210338, "trainable": false, "batch_input_shape": [null, 128], "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "output_dim": 50, "input_length": 128, "dtype": "float32", "mask_zero": false, "name": "embedding_11"}, "inbound_nodes": [[["input_11", 0, 0, {}]]], "name": "embedding_11", "class_name": "Embedding"}, {"config": {"recurrent_constraint": null, "trainable": true, "return_state": false, "go_backwards": false, "stateful": false, "implementation": 1, "dropout": 0.0, "return_sequences": true, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "activation": "sigmoid", "units": 60, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "unroll": false, "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "name": "lstm_layer"}, "inbound_nodes": [[["embedding_11", 0, 0, {}]]], "name": "lstm_layer", "class_name": "LSTM"}, {"config": {"trainable": true, "name": "global_max_pooling1d_11"}, "inbound_nodes": [[["lstm_layer", 0, 0, {}]]], "name": "global_max_pooling1d_11", "class_name": "GlobalMaxPooling1D"}, {"config": {"noise_shape": null, "name": "dropout_13", "rate": 0.1, "trainable": true, "seed": null}, "inbound_nodes": [[["global_max_pooling1d_11", 0, 0, {}]]], "name": "dropout_13", "class_name": "Dropout"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "units": 50, "name": "dense_19"}, "inbound_nodes": [[["dropout_13", 0, 0, {}]]], "name": "dense_19", "class_name": "Dense"}, {"config": {"noise_shape": null, "name": "dropout_14", "rate": 0.1, "trainable": true, "seed": null}, "inbound_nodes": [[["dense_19", 0, 0, {}]]], "name": "dropout_14", "class_name": "Dropout"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "sigmoid", "bias_constraint": null, "units": 6, "name": "dense_20"}, "inbound_nodes": [[["dropout_14", 0, 0, {}]]], "name": "dense_20", "class_name": "Dense"}], "name": "model_10", "output_layers": [["dense_20", 0, 0]], "input_layers": [["input_11", 0, 0]]}}